schreibfaul1/ESP32-audioI2S/src/Audio.h
    typedef struct _pwsts {                // used in processWebStreamTS
        uint32_t       availableBytes;     // available bytes in stream
        bool           f_firstPacket;
        bool           f_chunkFinished;
        bool           f_nextRound;
        uint32_t       byteCounter;        // count received data
        uint8_t        ts_packetStart = 0;
        uint8_t        ts_packetLength = 0;
        uint8_t        ts_packetPtr = 0;
        const uint8_t  ts_packetsize = 188;
        ps_ptr<uint8_t> ts_packet;
        size_t         chunkSize = 0;
    } pwsts_t;
    pwsts_t m_pwsst;

    typedef struct _rwh { // used in read_WAV_Header
        size_t   headerSize;
        uint32_t cs = 0;
        uint8_t  bts = 0;
    } rwh_t;
    rwh_t m_rwh;

    typedef struct _rflh { // used in read_FLAC_Header
        size_t   headerSize;
        size_t   retvalue = 0;
        bool     f_lastMetaBlock = false;
        uint32_t picPos = 0;
        uint32_t picLen = 0;
    } rflh_t;
    rflh_t m_rflh;

    typedef struct _phreh{ // used in parseHttpResponseHeader
        uint32_t ctime;
        uint32_t timeout;
        uint32_t stime;
        bool     f_time = false;
        bool     f_icy_data = false;
    } phreh_t;
    phreh_t m_phreh;

    typedef struct _phrah{ // used in parseHttpRangeHeader
        uint32_t ctime;
        uint32_t timeout;
        uint32_t stime;
        bool     f_time = false;
    } phrah_t;
    phrah_t m_phrah;

    typedef struct _sdet{ // used in streamDetection
        uint32_t tmr_slow = 0;
        uint32_t tmr_lost = 0;
        uint8_t  cnt_slow = 0;
        uint8_t  cnt_lost = 0;
    }sdet_t;
    sdet_t m_sdet;

    typedef struct _fnsy{ // used in findNextSync
        int      nextSync = 0;
        uint32_t swnf = 0;
    } fnsy_t;
    fnsy_t m_fnsy;

  public:
    Audio(uint8_t i2sPort = I2S_NUM_0);
    ~Audio();
    bool         openai_speech(const String& api_key, const String& model, const String& input, const String& instructions, const String& voice, const String& response_format, const String& speed);
    hwoe_t       dismantle_host(const char* host);
    bool         connecttohost(const char* host, const char* user = "", const char* pwd = "");
    bool         connecttospeech(const char* speech, const char* lang);
    bool         connecttoFS(fs::FS& fs, const char* path, int32_t m_fileStartPos = -1);
    void         setConnectionTimeout(uint16_t timeout_ms, uint16_t timeout_ms_ssl);
    bool         setAudioPlayPosition(uint16_t sec);
    bool         setFilePos(uint32_t pos);
    bool         setTimeOffset(int sec);
    bool         setPinout(uint8_t BCLK, uint8_t LRC, uint8_t DOUT, int8_t MCLK = I2S_GPIO_UNUSED);
    bool         pauseResume();
    bool         isRunning() { return m_f_running; }
    void         loop();
    uint32_t     stopSong();
    void         forceMono(bool m);
    void         setBalance(int8_t bal = 0);
    void         setVolumeSteps(uint8_t steps);
    void         setVolume(uint8_t vol, uint8_t curve = 0);
    uint8_t      getVolume();
    uint8_t      maxVolume();
    uint8_t      getI2sPort();
    uint32_t     getFileSize();
    uint32_t     getSampleRate();
    uint8_t      getBitsPerSample();
    uint8_t      getChannels();
    uint32_t     getBitRate(bool avg = false);
    uint32_t     getAudioFileDuration();
    uint32_t     getAudioCurrentTime();
    uint32_t     getTotalPlayingTime();
    uint16_t     getVUlevel();
    uint32_t     inBufferFilled();            // returns the number of stored bytes in the inputbuffer
    uint32_t     inBufferFree();              // returns the number of free bytes in the inputbuffer
    uint32_t     getInBufferSize();           // returns the size of the inputbuffer in bytes
    bool         setInBufferSize(size_t mbs); // sets the size of the inputbuffer in bytes
    void         setTone(int8_t gainLowPass, int8_t gainBandPass, int8_t gainHighPass);
    void         setI2SCommFMT_LSB(bool commFMT);
    int          getCodec() { return m_codec; }
    const char*  getCodecname() { return codecname[m_codec]; }
    const char*  getVersion() { return audioI2SVers; }

    // callbacks
    /**
     * @brief Set functional callback for string-based events
     * @note to dessign callback set it to a nullptr
     * @param cb - functional callback
     * @param type - type to enable
     */
    void setLiteralCallback(audio::literal_cb_t cb);
    // callback for ID3Image
    void setID3imageCallback(audio::id3image_cb_t cb){ _id3image_callback = cb; };
    // callback for OGG Image
    void setOGGimageCallback(audio::oggimage_cb_t cb){ _oggimage_callback = cb; };
    // callback for I2S processing
    void setI2SProcessCallback(audio::i2s_process_cb_t cb){ _i2s_process_callback = cb; };

    /**
     * @brief enable certain types of events for callbacks
     * @note 'all' enables all events
     * @note 'none' disables all events
     * 
     * @param type to enable
     * @param state 'true' to enable event, 'false' to disable
     */
    void enableCallbackType(audio::callback_type_t type, bool state);

  private:
    // ------- PRIVATE MEMBERS ----------------------------------------

    // callback wrappers
    template <typename... Args>
    void AUDIO_INFO(const char* fmt, Args&&... args);

    template <typename... Args>
    void AUDIO_ID3_DATA(const char* fmt, Args&&... args);

    void         latinToUTF8(ps_ptr<char>& buff, bool UTF8check = true);
    void         htmlToUTF8(char* str);
    void         setDefaults(); // free buffers and set defaults
    int32_t      audioFileRead(uint8_t* buff = nullptr, size_t len = 0);
    int32_t      audioFileSeek(uint32_t position, size_t len = 0);
    void         initInBuff();
    bool         httpPrint(const char* host);
    bool         httpRange(uint32_t range, uint32_t length = UINT32_MAX);
    void         processLocalFile();
    void         processWebStream();
    void         processWebFile();
    void         processWebStreamTS();
    void         processWebStreamHLS();
    void         playAudioData();
    bool         readPlayListData();
    const char*  parsePlaylist_M3U();
    const char*  parsePlaylist_PLS();
    const char*  parsePlaylist_ASX();
    ps_ptr<char> parsePlaylist_M3U8();
    uint16_t     accomplish_m3u8_url();
    int16_t      prepare_first_m3u8_url(ps_ptr<char>& playlistBuff);
    ps_ptr<char> m3u8redirection(uint8_t* codec);
    void         showCodecParams();
    int          findNextSync(uint8_t* data, size_t len);
    uint32_t     decodeError(int8_t res, uint8_t* data, int32_t bytesDecoded);
    uint32_t     decodeContinue(int8_t res, uint8_t* data, int32_t bytesDecoded);
    int          sendBytes(uint8_t* data, size_t len);
    void         setDecoderItems();
    void         computeAudioTime(uint16_t bytesDecoderIn, uint16_t bytesDecoderOut);
    void         showID3Tag(const char* tag, const char* val);
    size_t       readAudioHeader(uint32_t bytes);
    int          read_WAV_Header(uint8_t* data, size_t len);
    int          read_FLAC_Header(uint8_t* data, size_t len);
    int          read_ID3_Header(uint8_t* data, size_t len);
    int          read_ID3_Header_new(uint8_t* data, size_t len);
    int          read_M4A_Header(uint8_t* data, size_t len);
    size_t       process_m3u8_ID3_Header(uint8_t* packet);
    bool         setSampleRate(uint32_t hz);
    bool         setBitsPerSample(int bits);
    bool         setChannels(int channels);
    bool         setBitrate(int br);
    size_t       resampleTo48kStereo(const int16_t* input, size_t inputFrames);
    void         playChunk();
    void         computeVUlevel(int16_t sample[2]);
    void         computeLimit();
    void         Gain(int16_t* sample);
    void         showstreamtitle(char* ml);
    bool         parseContentType(char* ct);
    bool         parseHttpResponseHeader();
    bool         parseHttpRangeHeader();
    bool         initializeDecoder(uint8_t codec);
    esp_err_t    I2Sstart();
    esp_err_t    I2Sstop();
    void         zeroI2Sbuff();
    void         IIR_filterChain0(int16_t iir_in[2], bool clear = false);
    void         IIR_filterChain1(int16_t iir_in[2], bool clear = false);
    void         IIR_filterChain2(int16_t iir_in[2], bool clear = false);
    uint32_t     streamavail() { return m_client ? m_client->available() : 0; }
    void         IIR_calculateCoefficients(int8_t G1, int8_t G2, int8_t G3);
    bool         ts_parsePacket(uint8_t* packet, uint8_t* packetStart, uint8_t* packetLength);

    //+++ create a T A S K  for playAudioData(), output via I2S +++
  public:
    void         setAudioTaskCore(uint8_t coreID);
    uint32_t     getHighWatermark();

